package test0001;

public class Q4_3 {

	public static void main(String[] args){

		int x = 0;

		int y = 10;


		do {

			y--;

			++x;

		}while( x < 5);

		System.out.println(x + "," + y);






	}
}


//1回目の処理
//ｙが後置デクリメントなので　１０、
//ｘが前置きインクリメンとなので１、
//whileの判定はfalse（X=１、y=10)
//
//2回目の処理
//yが後置デクリメントなので 9、
//xが前置きインクリメンとなので2
//
//

//
//プログラマカレッジ2019年5月生日記

//
//令和元年5月7日(月)
//
//プログラマカレッジ5月生初日。
//初回のみ14時開始。
//席は座った順※1で決まるので、
//エアコン位置、通路側、等色々考える必要あり
//※1 途中で進捗度合いによる席替え有り。
//学習の流れや教室利用の注意点などの説明、
//席近所の方と簡単な自己紹介＋自己紹介ゲーム的なことを行う※メモ帳とペン必須その後17:55に解散。
//1日目終了 感想
//無料とは思えない位カリキュラムや教材が充実しており、また教材の説明も分かりやすいです。
//パソコンはすべて支給なのでイヤホンのみで大丈夫。座席配置、前後スペースなども問題なし。
//ただ、贅沢言えませんが、、、椅子があまり良くなく長時間座ると腰に来ます。いつか椅子を寄付したいです。
//
//近所に食事処が少なく、隣にあるセブンが唯一の娯楽。
//生徒は20台前半～後半の落ち着いた生徒が多い。
//男性24人、女性4人の28人が5月生の人数の様です
//

//令和元年 5月8日(水)
//
//学習スタート。
//HTML,CSS,javascript,jQuety,php,mysql,XAMPP,コマンドプロンプト,github,java 等、
//カリキュラム内容は盛り沢山。
//僕は以前webcampproというスクールで学んだのである程度の基礎はありましたが、
//全くの初めての方だと少し重めなカリキュラムだと思います。
//しかしプログラマとしてとても大事なことを分かりやすく説明(動画)してくれるので、
//諦めなければちゃんとしたプログラマになれるカリキュラムだと思います。
//正直、有料のスクールよりも充実したカリキュラムだと思います。
//
//
//2日目終了 感想
//写経課題が多いのでとにかく指を動かして覚えた方が良いと思います。
//ノートに書き写すスタイルだと、時間が掛かる上にただノートを作るだけなのでオススメはしません。
//(実際、一所懸命にノートに書き写してる方はかなり進捗が遅れてました。)
//また、気が合いそうな人と知り合いになって少し話すのもオススメです。
//色々相談もできますし、情報交換もできると思います。
//なによりコミュ力の良いトレーニングになると思います。
//
//令和元年 5月9日(木)
///とにかく写経。ひたすら写経です。
//余談ですが、半蔵門線はすごく混むので非推奨です。
//また、9:30前は教室に入れないので近くで時間を潰す必要があります。

//令和元年 5月10日(金)
//前日に続きとにかく写経です。
//夢中になって昼休みも食べずに学習していたら午後頭が働きませんでした。
//お昼はしっかり食べましょう！
//追記　腰は深刻なレベルで痛くなります。マットor腰痛対策必須です。
//
//令和元年 5月13日(月)
////とにかく写経です。
//となりのKさんと仲良くなりました。元々IT専門学校を卒業されていたらしく進捗が早いです。
//独学でJavaも勉強していたそうなので良き相談相手になります。

//令和元年 5月14日(火)
//前週に続きひたすら写経。しかしカリキュラムが楽しいので全く飽きる気配がありません。
//気づいたのですが、電子レンジは1つしかないのでお昼はかなり混むみたいです。
//男子トイレは立ち×２、便器×２なのであまり混まないと思います。
//女子トイレは申し訳ありませんが分かりません。


//令和元年 5月15日(水)
//となりのKさんと近所を散策。半蔵門駅の方に個人経営の定食屋さん有り。
//オフィス街の為、お昼はどこも混みますがスクールのお昼休みが11:50からなので
//運がよければ混む前に定食屋さんに滑り込めます。
//
//令和元年 5月16日(木)
//お昼に靖国神社前のインドカレー屋さんに行きました。
//少し水っぽい(これが本場のカレーなのかもしれません)でしたがナンとライスが食べ放題なので
//満足です。
//学習の方はひたすら写経ですが、早い人は1ヶ月目に行うカリキュラムを終えて自習or復習に
//入っていました。
//
//令和元年 5月17日(金)
//僕は少し進捗が早く1ヶ月目のカリキュラムを終えていたので、javaBronzeの為の勉強を
//行っていました。
//この日は15:20から席替えがあり、隣のKさんとはさようならでした。(といっても少し遠めの斜め右前にいるので常に視界に入ります 笑)
//しかし席が離れるとどうしてもご近所さんと仲良くする必要が出てくるので、今後は
//少し会話する頻度も減るのが必至かとおもいます。
//その後、新しい席のご近所さん(6人)で自己紹介＋ミニ人狼ゲームを行いました。
//全員違う都道府県ということで(神奈川、北海道、熊本、埼玉、山口、京都)、
//若干の訛り等があり興味深いと思いました。皆さん常識のありそうな方々で安心しました。
//
//令和元年 5月20日(月)
//早いもので学習も3週目に突入しました。(GWと重なった影響で学習期間が少し短いです。)
//カリキュラムを終えた方増えており、
//本日から2ヶ月目に行う予定のカリキュラムを予習許可が出ました。内容はJSPとservletです。
//皆さんの学習状況をぱっと拝見した感じで、
//やはりノートに一所懸命に写している方は進捗がかなり遅れていると見られます。
//(その方は周りと誰も話さず黙々と作業しているので、誰も指摘しません...)
//誰か仲の良い人がいれば「○○した方がいいですよ」気軽にアドバイスも言えるので、
//やはりこういう場所では気の合う人を見つけた方が良いと思えます。
//(全く話さない人にアドバイスして逆ギレされても怖いです...)
//ちなみにその辺りについては講師からの助言やアドバイスは一切ないので自己責任になります。
//ちなみに、4人居た女性が3人に減っていました。同期生が居なくなるのは少し寂しい気持ちになります。
//

//令和元年 5月21日(火)
//今日は午前中に大雨警報が出ており、電車遅延の為何人か遅れて登校している方がいました。
//少し早い電車に乗ってきたので何とか大丈夫でしたが...。【僕は神奈川県の田舎から2時間掛けて通学しています)
//今日はJavaのサーブレットの写経を行います。左となりのO君とほぼ同じペースなので質問もしやすく安心感があります。
//右隣のYさんはPHPの学習をされているそうです。5月生はGW分休みの為学習期間が短縮されるので大変です。

//やってみて、言って聞かせて、させてみて、褒めてやらねば人は育たず。
//話し合い、耳を傾け、承認し、任せてやらねば、人は育たず。
//やっている、姿を感謝で見守って、信頼せねば、人は実らず



